# IsValidSampleHeight Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..IsValidSampleHeight Method
CompoundStructure Class See Also
---
Is the specified height a valid sample height for this compound structure?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsValidSampleHeight(
	double height
)
```

Visual Basic
---
```text
Public Function IsValidSampleHeight ( _
	height As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSampleHeight(
	double height
)
```

# ### Parameters
height
    Type: System..::..Double
# Remarks
The sample height cannot be less than the value of MinimumSampleHeight.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace